// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.
let num1 = Number(prompt("Введите любое число"));
console.log(num1 <=1 ? 'num1 <= 1 test passed' : 'num1 <= 1 test failed');

let num2 = Number(prompt("Введите любое число"));
console.log(num2 >=3 ? 'num2 >= 3 test passed' : 'num2 >= 3 test failed');


// Задание 2
// Перепишите код к тернарному оператору
// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }
let test = true;
console.log(test ? '+++' : "---");


// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число 
// (в первую, вторую или третью).

let decadeByMonthsDay = monthsDay => {
    if (!monthsDay || monthsDay < 0 || monthsDay > 31) {return 0}; // 0 - декады не бывает, исп. как код ошибки?
    if (monthsDay <= 10) {
        return 1;
    } else if (monthsDay <= 20) {
        return 2;
    } else {
        return 3;
    }
}

console.log(`Декада дня -1 = ${decadeByMonthsDay(-1)}`);
console.log(`Декада дня 1 = ${decadeByMonthsDay(1)}`);
console.log(`Декада дня 10 = ${decadeByMonthsDay(10)}`);
console.log(`Декада дня 11 = ${decadeByMonthsDay(11)}`);
console.log(`Декада дня 20 = ${decadeByMonthsDay(20)}`);
console.log(`Декада дня 21 = ${decadeByMonthsDay(21)}`);
console.log(`Декада дня 30 = ${decadeByMonthsDay(30)}`);
console.log(`Декада дня 31 = ${decadeByMonthsDay(31)}`);
console.log(`Декада дня 42 = ${decadeByMonthsDay(42)}`);


// Задание 4
// Необязательное задание. (Если вам показалось домашнее задание простым, выполняем данный пункт)
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)
// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.
// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"
// Пример 2:
// Пользователь ввел число 74. Программа должна вывести:
// "В числе 74 количество сотен: 0, десятков: 7, единиц: 4"
// Пример 3:
// Пользователь ввел число 9537. Программа должна вывести:
// "В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"
// Уточнение: пользователь всегда вводит корректное положительное целое число.

let number = Number(prompt('Введите число'));

const units = number % 10;
const dozens = (number - units)/10 % 10; 
//const dozens =  Math.floor(number / 10 % 10); - альтернатива через встроенные функции
const hungreds = (number - units - dozens*10)/100 % 10;
//const dozens =  Math.floor(number / 100 % 10); - альтернатива через встроенные функции

console.log(`В числе ${number} количество сотен: ${hungreds}, десятков: ${dozens}, единиц: ${units}`)

