// Задание 1
// Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

const temperatureC = 36.6;
const temperatureF = (9/5) * temperatureC + 32;

console.log(`Температура в Цельсиях ${temperatureC}
Температура в Фаренгейтах ${temperatureF}`);


// Задание 2
// Необходимо создать переменную name, записать в эту переменную свое имя. Необходимо также \
// создать переменную admin и присвоить этой переменной значение из переменной name. Вывести значение переменной admin в консоль.

let name = 'Alexander';
let admin = name;

console.log(admin);